# NCF Deal Manager — NVIDIA Triton Inference Server configuration
# Architecture: NVIDIA DeepLearningExamples NeuMF (He et al. 2017)
# Backend: ONNX Runtime (CPU or GPU via CUDA EP)
#
# Inputs:
#   user_ids: [batch] int64 — hashed user ID (0..1999)
#   item_ids: [batch] int64 — hashed deal ID (0..1999)
#
# Output:
#   relevance_scores: [batch] float32 — user-deal relevance probability

name: "ncf_deal_manager"
backend: "onnxruntime"
max_batch_size: 128

input [
  {
    name: "user_ids"
    data_type: TYPE_INT64
    dims: [ 1 ]
    reshape: { shape: [] }
  },
  {
    name: "item_ids"
    data_type: TYPE_INT64
    dims: [ 1 ]
    reshape: { shape: [] }
  }
]

output [
  {
    name: "relevance_scores"
    data_type: TYPE_FP32
    dims: [ 1 ]
    reshape: { shape: [] }
  }
]

dynamic_batching {
  preferred_batch_size: [ 16, 32, 64 ]
  max_queue_delay_microseconds: 500
}

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]
